DocumentJournals/ЖурналОпераций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DocumentJournal>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЖурналОпераций</Name>
			<RegisteredDocuments>
				<xr:Item>Document.ОтражениеЗарплатыВБухучете</xr:Item>
				<xr:Item>Document.ОбесценениеВнеоборотныхАктивов</xr:Item>
				<xr:Item>Document.АвансовыйОтчет</xr:Item>
			</RegisteredDocuments>
		</Properties>
		<ChildObjects>
			<Column>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорКонтрагента</Name>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВалютаДокумента</Name>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ответственный</Name>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Информация</Name>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СостояниеРеглОперации</Name>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РучнаяКорректировка</Name>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаДокумента</Name>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидОперации</Name>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерВходящегоДокумента</Name>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаВходящегоДокумента</Name>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
				</Properties>
			</Column>
		</ChildObjects>
	</DocumentJournal>
</MetaDataObject>

InformationRegisters/СтатусыДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СтатусыДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Статус</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Документ</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СостоянияБанковскихДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СостоянияБанковскихДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияБанковскихДокументов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СсылкаНаОбъект</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыСостоянийРегламентныхОпераций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ВидыСостоянийРегламентныхОпераций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВыполненоСОшибками</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НеВыполнено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Выполняется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Выполнено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Пропущено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ПриходныйКассовыйОрдер.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ПриходныйКассовыйОрдер</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Контрагент</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РасшифровкаПлатежа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДоговорКонтрагента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/СчетНаОплатуПокупателю.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СчетНаОплатуПокупателю</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/СчетНаОплатуПоставщика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СчетНаОплатуПоставщика</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/РеализацияТоваровУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>РеализацияТоваровУслуг</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>АгентскиеУслуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДоговорКонтрагента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/АктОбОказанииПроизводственныхУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>АктОбОказанииПроизводственныхУслуг</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/АктСверкиВзаиморасчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>АктСверкиВзаиморасчетов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПоДаннымОрганизации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПоДаннымКонтрагента</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DocumentJournals/ЖурналОпераций/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаСервере
Процедура АЛФ_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)

	//Переопределение запроса
	ТекстЗапроса = "ВЫБРАТЬ
			|	ЖурналДокументовЖурналОпераций.Ссылка КАК Ссылка,
			|	ЖурналДокументовЖурналОпераций.Дата КАК Дата,
			|	ЕСТЬNULL(ЖурналДокументовЖурналОпераций.Ссылка.МежотчетныйПериод, ЛОЖЬ) КАК МежотчетныйПериод,
			|	ЖурналДокументовЖурналОпераций.ПометкаУдаления КАК ПометкаУдаления,
			|	ЖурналДокументовЖурналОпераций.Номер КАК Номер,
			|	ЖурналДокументовЖурналОпераций.Проведен КАК Проведен,
			|	ЖурналДокументовЖурналОпераций.Организация КАК Организация,
			|	ЖурналДокументовЖурналОпераций.Информация КАК Информация,
			|	ЖурналДокументовЖурналОпераций.Тип КАК Тип,
			|	ВЫБОР
			|		КОГДА ЖурналДокументовЖурналОпераций.СостояниеРеглОперации ЕСТЬ NULL
			|			ТОГДА ВЫБОР
			|					КОГДА ЖурналДокументовЖурналОпераций.Тип = ТИП(Документ.ОперацияБух)
			|						ТОГДА ВЫБОР
			|								КОГДА ЖурналДокументовЖурналОпераций.ПометкаУдаления = ИСТИНА
			|									ТОГДА 2
			|								ИНАЧЕ 1
			|							КОНЕЦ
			|					ИНАЧЕ ВЫБОР
			|							КОГДА ЖурналДокументовЖурналОпераций.РучнаяКорректировка = ИСТИНА
			|								ТОГДА ВЫБОР
			|										КОГДА ЖурналДокументовЖурналОпераций.ПометкаУдаления = ИСТИНА
			|											ТОГДА 10
			|										КОГДА ЖурналДокументовЖурналОпераций.Проведен = ЛОЖЬ
			|											ТОГДА 9
			|										ИНАЧЕ 8
			|									КОНЕЦ
			|							ИНАЧЕ ВЫБОР
			|									КОГДА ЖурналДокументовЖурналОпераций.ПометкаУдаления = ИСТИНА
			|										ТОГДА 2
			|									КОГДА ЖурналДокументовЖурналОпераций.Проведен = ИСТИНА
			|										ТОГДА 1
			|									ИНАЧЕ 0
			|								КОНЕЦ
			|						КОНЕЦ
			|				КОНЕЦ
			|		ИНАЧЕ ВЫБОР
			|				КОГДА ЖурналДокументовЖурналОпераций.ПометкаУдаления
			|					ТОГДА 2
			|				КОГДА ЖурналДокументовЖурналОпераций.СостояниеРеглОперации = ЗНАЧЕНИЕ(Перечисление.ВидыСостоянийРегламентныхОпераций.НеВыполнено)
			|						ИЛИ ЖурналДокументовЖурналОпераций.СостояниеРеглОперации = ЗНАЧЕНИЕ(Перечисление.ВидыСостоянийРегламентныхОпераций.Выполняется)
			|					ТОГДА 0
			|				КОГДА ЖурналДокументовЖурналОпераций.СостояниеРеглОперации = ЗНАЧЕНИЕ(Перечисление.ВидыСостоянийРегламентныхОпераций.ВыполненоСошибками)
			|					ТОГДА 6
			|				КОГДА ЖурналДокументовЖурналОпераций.СостояниеРеглОперации = ЗНАЧЕНИЕ(Перечисление.ВидыСостоянийРегламентныхОпераций.Выполнено)
			|						И ЖурналДокументовЖурналОпераций.РучнаяКорректировка
			|					ТОГДА 5
			|				КОГДА ЖурналДокументовЖурналОпераций.СостояниеРеглОперации = ЗНАЧЕНИЕ(Перечисление.ВидыСостоянийРегламентныхОпераций.Пропущено)
			|					ТОГДА 7
			|				ИНАЧЕ 4
			|			КОНЕЦ
			|	КОНЕЦ КАК СостояниеДокумента,
			|	ЖурналДокументовЖурналОпераций.СуммаДокумента КАК СуммаДокумента,
			|	ЖурналДокументовЖурналОпераций.ВалютаДокумента КАК ВалютаДокумента,
			|	ЖурналДокументовЖурналОпераций.РучнаяКорректировка КАК РучнаяКорректировка,
			|	ЖурналДокументовЖурналОпераций.ВидОперации КАК ВидОперации,
			|	ЖурналДокументовЖурналОпераций.ДоговорКонтрагента КАК ДоговорКонтрагента,
			|	ЖурналДокументовЖурналОпераций.НомерВходящегоДокумента КАК НомерВходящегоДокумента,
			|	ЖурналДокументовЖурналОпераций.ДатаВходящегоДокумента КАК ДатаВходящегоДокумента,
			|	ЖурналДокументовЖурналОпераций.Ответственный КАК Ответственный,
			|	ЖурналДокументовЖурналОпераций.Комментарий КАК Комментарий,  
			//Добавка
			|	ВЫБОР КОГДА ЖурналДокументовЖурналОпераций.Ссылка ССЫЛКА Документ.ПриходныйКассовыйОрдер ТОГДА ЖурналДокументовЖурналОпераций.Ссылка.ИИТ_ОбъектСтроительства 
			|		ИНАЧЕ ЖурналДокументовЖурналОпераций.ИИТ_ОбъектСтроительства КОНЕЦ КАК ИИТ_ОбъектСтроительства,
			|	ЖурналДокументовЖурналОпераций.ИИТ_ЭтапСтроительства КАК ИИТ_ЭтапСтроительства,
			|	ВЫБОР КОГДА ЖурналДокументовЖурналОпераций.Ссылка ССЫЛКА Документ.ПриходныйКассовыйОрдер И 
			|	ЖурналДокументовЖурналОпераций.Ссылка.Контрагент.НаименованиеПолное <> ЖурналДокументовЖурналОпераций.Ссылка.ПринятоОт И
			|	ЖурналДокументовЖурналОпераций.Ссылка.Контрагент.Наименование <> ЖурналДокументовЖурналОпераций.Ссылка.ПринятоОт ТОГДА ЖурналДокументовЖурналОпераций.Ссылка.ПринятоОт ИНАЧЕ """" КОНЕЦ КАК МОЛ,
            //Конец добавки
			|	ВЫБОР
			|		КОГДА НЕ ЖурналДокументовЖурналОпераций.СостояниеРеглОперации ЕСТЬ NULL
			|			ТОГДА ЖурналДокументовЖурналОпераций.СостояниеРеглОперации
			|		КОГДА ЖурналДокументовЖурналОпераций.Тип = ТИП(Документ.СчетНаОплатуПокупателю)
			|				ИЛИ ЖурналДокументовЖурналОпераций.Тип = ТИП(Документ.СчетНаОплатуПоставщика)
			|			ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(СтатусыДокументов.Статус, &СтатусОплатыПоУмолчанию) КАК Перечисление.СтатусОплатыСчета)
			|		КОГДА ЖурналДокументовЖурналОпераций.Тип = ТИП(Документ.РеализацияТоваровУслуг)
			|				ИЛИ ЖурналДокументовЖурналОпераций.Тип = ТИП(Документ.АктОбОказанииПроизводственныхУслуг)
			|				ИЛИ ЖурналДокументовЖурналОпераций.Тип = ТИП(Документ.АктСверкиВзаиморасчетов)
			|			ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(СтатусыДокументов.Статус, &СтатусРеализацииПоУмолчанию) КАК Перечисление.СтатусыДокументовРеализации)
			|		КОГДА ЖурналДокументовЖурналОпераций.Тип = ТИП(Документ.ПоступлениеТоваровУслуг)
			|				ИЛИ ЖурналДокументовЖурналОпераций.Тип = ТИП(Документ.ПоступлениеДопРасходов)
			|				ИЛИ ЖурналДокументовЖурналОпераций.Тип = ТИП(Документ.СчетФактураПолученный)
			|			ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(СтатусыДокументов.Статус, &СтатусПоступленияПоУмолчанию) КАК Перечисление.СтатусыДокументовПоступления)
			|		КОГДА ЖурналДокументовЖурналОпераций.Тип = ТИП(Документ.ВыплатыСамозанятым)
			|			ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(СтатусыДокументов.Статус, &СтатусВыплатыСамозанятымПоУмолчанию) КАК Перечисление.СтатусыДокументовВыплатыСамозанятым)
			|		КОГДА ЖурналДокументовЖурналОпераций.Тип = ТИП(Документ.ОтражениеЗарплатыВБухучете)
			|			ТОГДА ВЫБОР
			|					КОГДА ВЫРАЗИТЬ(ЖурналДокументовЖурналОпераций.Ссылка КАК Документ.ОтражениеЗарплатыВБухучете).ЗарплатаОтраженаВБухучете
			|						ТОГДА &ТекстОтраженВБухучете
			|					ИНАЧЕ &ТекстНеОтраженВБухучете
			|				КОНЕЦ
			|		КОГДА ЖурналДокументовЖурналОпераций.Тип = ТИП(Документ.ПлатежноеПоручение)
			|				ИЛИ ЖурналДокументовЖурналОпераций.Тип = ТИП(Документ.ПлатежноеТребование)
			|			ТОГДА СостоянияБанковскихДокументов.Состояние
			|		КОГДА ЖурналДокументовЖурналОпераций.Тип = ТИП(Документ.КоммерческоеПредложение)
			|			ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(СтатусыДокументов.Статус, &СтатусКоммерческогоПредложенияПоУмолчанию) КАК Перечисление.СтатусыКоммерческогоПредложения)
			|	КОНЕЦ КАК Состояние
			|ИЗ
			|	ЖурналДокументов.ЖурналОпераций КАК ЖурналДокументовЖурналОпераций
			|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыДокументов КАК СтатусыДокументов
			|		ПО ЖурналДокументовЖурналОпераций.Организация = СтатусыДокументов.Организация
			|			И ЖурналДокументовЖурналОпераций.Ссылка = СтатусыДокументов.Документ}
			|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияБанковскихДокументов КАК СостоянияБанковскихДокументов
			|		ПО ЖурналДокументовЖурналОпераций.Ссылка = СостоянияБанковскихДокументов.СсылкаНаОбъект}
			|{ГДЕ
			|	(ЖурналДокументовЖурналОпераций.Ссылка В
			|			(ВЫБРАТЬ
			|				ДокументыПоКонтрагенту.Ссылка
			|			ИЗ
			|				КритерийОтбора.ДокументыПоКонтрагенту(&ОтборКонтрагент) КАК ДокументыПоКонтрагенту)),
			|	(ЖурналДокументовЖурналОпераций.Ссылка В
			|			(ВЫБРАТЬ
			|				ДокументыПоДоговоруКонтрагента.Ссылка
			|			ИЗ
			|				КритерийОтбора.ДокументыПоДоговоруКонтрагента(&ОтборДоговорКонтрагента) КАК ДокументыПоДоговоруКонтрагента)),
			|	(ЖурналДокументовЖурналОпераций.Ссылка В (&ОтборСсылки)),
			|	(ЖурналДокументовЖурналОпераций.Тип В (&ОтборТипыДокументов)),
			|	(НЕ ЖурналДокументовЖурналОпераций.Тип В (&ТипыИсключаемыхДокументов))}";
	
	СвойстваСписка = ОбщегоНазначения.СтруктураСвойствДинамическогоСписка();
	СвойстваСписка.ОсновнаяТаблица = "ЖурналДокументов.ЖурналОпераций";
	СвойстваСписка.ДинамическоеСчитываниеДанных = Истина;
	СвойстваСписка.ТекстЗапроса = ТекстЗапроса;
	ОбщегоНазначения.УстановитьСвойстваДинамическогоСписка(Элементы.Список,
		СвойстваСписка);     
		
	//Поля списка
	ЭлементСпискаФормы = Элементы.Добавить("МОЛ", Тип("ПолеФормы"), Элементы.Список);
	ЭлементСпискаФормы.Заголовок = "МОЛ"; 
	ЭлементСпискаФормы.Вид = ВидПоляФормы.ПолеНадписи; 
	ЭлементСпискаФормы.ПутьКДанным = "Список.МОЛ";   
	
	ЭлементСпискаФормы = Элементы.Добавить("ИИТ_ОбъектСтроительства", Тип("ПолеФормы"), Элементы.Список);
	ЭлементСпискаФормы.Заголовок = "Объект строительства"; 
	ЭлементСпискаФормы.Вид = ВидПоляФормы.ПолеНадписи; 
	ЭлементСпискаФормы.ПутьКДанным = "Список.ИИТ_ОбъектСтроительства";   

	ЭлементСпискаФормы = Элементы.Добавить("ИИТ_ЭтапСтроительства", Тип("ПолеФормы"), Элементы.Список);
	ЭлементСпискаФормы.Заголовок = "Этап строительства"; 
	ЭлементСпискаФормы.Вид = ВидПоляФормы.ПолеНадписи; 
	ЭлементСпискаФормы.ПутьКДанным = "Список.ИИТ_ЭтапСтроительства";   

КонецПроцедуры
